/*
:::::::::: :::::::::: :::::::::: :::::::::: :::::::::: :::::::::: ::::::::::

  ИНТЕРФЕЙС: IMoveSlider

:::::::::: :::::::::: :::::::::: :::::::::: :::::::::: :::::::::: ::::::::::
*/


// ########## STANDART

// ########## ТИПЫ
import type { ESlide } from "@entities/Slides/Slides.types";

// ########## СТИЛИ

// ########## КОМПОНЕНТЫ

// ########## МОДУЛИ


/* ::::::: :::::::::: :::::::::: :::::::::: :::::::::: :::::::::: ::::::: */

/**
 * Интерфейс для взаимодействия с модулем MoveSlider.
 * - `getSlide`      : Получить слайд по индексу (loop).
 * - `getSlides`     : Получить набор из 3-х слайдов вокруг индекса (index - 1, index, index + 1).
 */
export default interface IMoveSlider {
   getSlide: (index: number) => ESlide;
   getSlides: (index: number) => ESlide[];
};
