/*
:::::::::: :::::::::: :::::::::: :::::::::: :::::::::: :::::::::: ::::::::::

  ИНТЕРФЕЙС: IScreen

:::::::::: :::::::::: :::::::::: :::::::::: :::::::::: :::::::::: ::::::::::
*/


// ########## STANDART

// ########## ТИПЫ
import type { JSX } from "react";

// ########## СТИЛИ

// ########## КОМПОНЕНТЫ

// ########## МОДУЛИ


/* ::::::: :::::::::: :::::::::: :::::::::: :::::::::: :::::::::: ::::::: */

/**
 * Параметры для инициализации нового полного экрана поверх контента.
 * - `closeAction`   : событие которые произойдет после закрытия экрана.
 * - `children`      : JSX контент который будет отображатся внутри нового экрана.
 */
export default interface IScreen {
   closeAction: () => void;
   children: JSX.Element;
};
