/*
:::::::::: :::::::::: :::::::::: :::::::::: :::::::::: :::::::::: ::::::::::

  МОДУЛЬ: useBodyTheme
  - модуль для работы с цветовыми модами приложения.

:::::::::: :::::::::: :::::::::: :::::::::: :::::::::: :::::::::: ::::::::::
*/


// ########## STANDART
import { useEffect } from "react";

// ########## ТИПЫ

// ########## СТИЛИ

// ########## КОМПОНЕНТЫ

// ########## МОДУЛИ


/* ::::::: :::::::::: :::::::::: :::::::::: :::::::::: :::::::::: ::::::: */


const useBodyTheme = (theme: string | undefined) => {

   useEffect(() => {

      if (!theme) return;

      document.body.dataset.theme = theme;

      return () => {
         delete document.body.dataset.theme;
      };

   }, [theme]);

};


/* ::::::: :::::::::: :::::::::: :::::::::: :::::::::: :::::::::: ::::::: */

export default useBodyTheme;
