/*
:::::::::: :::::::::: :::::::::: :::::::::: :::::::::: :::::::::: ::::::::::

  ИНТЕРФЕЙС: IBtnIcon

:::::::::: :::::::::: :::::::::: :::::::::: :::::::::: :::::::::: ::::::::::
*/

// ########## STANDART
import type { JSX } from "react";

// ########## ТИПЫ

// ########## СТИЛИ

// ########## КОМПОНЕНТЫ

// ########## МОДУЛИ

/* ::::::: :::::::::: :::::::::: :::::::::: :::::::::: :::::::::: ::::::: */


/**
 * Параметры для инициализации объекта BtnIcon.
 * - `path`     : ссылка на страницу.
 * - `size`     : размер кнопки.
 * - `isNew?`   : обратите внимание (красный кружок).
 * - `children` : размер иконка.
 */
export default interface IBtnIcon {
   path: string;
   size: "fill" | 18 | 20 | 22 | 24 | 26 | 28 | 30 | 32 | 34 | 36 | 38 | 40;
   isNew?: boolean;
   children: JSX.Element;
};
