/*
:::::::::: :::::::::: :::::::::: :::::::::: :::::::::: :::::::::: ::::::::::

  ИНТЕРФЕЙС: IBtnGame

:::::::::: :::::::::: :::::::::: :::::::::: :::::::::: :::::::::: ::::::::::
*/

/**
 * Параметры для инициализации объекта BtnGame.
 * - `mode`    : тип кнопки.
 * - `size`    : размер кнопки.
 * - `action`  : событие для выполнени после нажатия на кнопку.
 */
export default interface IBtnGame {
   mode: "add" | "close";
   size: "fill" | 18 | 20 | 22 | 24 | 26 | 28 | 30 | 32 | 34 | 36 | 38 | 40;
   action: () => void;
};
