/*
:::::::::: :::::::::: :::::::::: :::::::::: :::::::::: :::::::::: ::::::::::

  ИНТЕРФЕЙС: IMenuItem

:::::::::: :::::::::: :::::::::: :::::::::: :::::::::: :::::::::: ::::::::::
*/

// ########## STANDART
import type { JSX } from "react";

// ########## ТИПЫ

// ########## СТИЛИ

// ########## КОМПОНЕНТЫ

// ########## МОДУЛИ

/* ::::::: :::::::::: :::::::::: :::::::::: :::::::::: :::::::::: ::::::: */

/**
 * Интерфейс с набором параметров для элемента меню - MenuItem.
 * - `title`      : название элемента меню.
 * - `path`       : web путь к странице.
 * - `children`   : компонент иконки.
 */
export default interface IMenuItem {
   title: string;
   path: string;
   children: JSX.Element;
   position?: "first" | "last";
};
